app/graphql/mutations/create_user.rb

        def resolve(name: nil, uid: nil, provider: nil)
            user = User.find_or_initialize_by(uid: uid)
            if !!user.id
                user
            else
                User.create!(
                    name: name,
                    uid: uid,
                    provider: provider,
                )
---
SELECT "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "test123"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at", "provider", "uid") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "GraphQL Test"], ["created_at", "2020-06-17 15:54:16.839289"], ["updated_at", "2020-06-17 15:54:16.839289"], ["provider", "graphQL-test"], ["uid", "test123"]]