app/controllers/api/v1/hexagrams_controller.rb

SELECT "hexagrams".* FROM "hexagrams"
---
    def index
        hexagrams = Hexagram.all

SELECT "hexagrams".* FROM "hexagrams" WHERE "hexagrams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        hexagram = Hexagram.find(params[:id])